stvenmobile/vectorscope/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="huge_app.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_PANEL_DRIVERS_BUS_USE_RGB=y
CONFIG_ESP_PANEL_DRIVERS_LCD_USE_ST7262=y
CONFIG_ESP_PANEL_DRIVERS_BACKLIGHT_COMPILE_UNUSED_DRIVERS=n

CONFIG_ESP_PANEL_BOARD_DEFAULT_USE_CUSTOM=y
CONFIG_ESP_PANEL_BOARD_NAME="Elecrow:CrowPanel_Advance_5_0"
CONFIG_ESP_PANEL_BOARD_WIDTH=800
CONFIG_ESP_PANEL_BOARD_HEIGHT=480

CONFIG_ESP_PANEL_BOARD_USE_LCD=y
CONFIG_ESP_PANEL_LCD_CONTROLLER_ST7262=y
CONFIG_ESP_PANEL_BOARD_LCD_BUS_TYPE_RGB=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_USE_CONTROL_PANEL=n
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HPW=4
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HBP=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HFP=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VPW=4
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VBP=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VFP=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_CLK_HZ=16000000
CONFIG_ESP_PANEL_BOARD_LCD_RGB_PCLK_ACTIVE_NEG=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_BOUNCE_BUF_SIZE=8000
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_HSYNC=40
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_VSYNC=41
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DE=42
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_PCLK=39
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DISP=1
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA0=21
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA1=47
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA2=48
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA3=45
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA4=38
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA5=9
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA6=10
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA7=11
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA8=12
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA9=13
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA10=14
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA11=7
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA12=17
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA13=18
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA14=3
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA15=46
CONFIG_ESP_PANEL_BOARD_LCD_COLOR_BITS_RGB565=y
CONFIG_ESP_PANEL_BOARD_LCD_COLOR_BITS=16

CONFIG_ESP_PANEL_BOARD_USE_TOUCH=y
CONFIG_ESP_PANEL_BOARD_TOUCH_CONTROLLER_GT911=y
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_ADDRESS=93
CONFIG_ESP_PANEL_BOARD_TOUCH_BUS_SKIP_INIT_HOST=y

CONFIG_ESP_PANEL_BOARD_USE_BACKLIGHT=n

CONFIG_ESP_PANEL_BOARD_EXPANDER_SKIP_INIT_HOST=y
CONFIG_ESP_PANEL_BOARD_EXPANDER_I2C_ADDRESS=24

CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=100
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6000
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

CONFIG_I2C_BUS_BACKWARD_CONFIG=y

CONFIG_ESP_PANEL_BUS_I2C_SKIP_INIT_HOST=y
CONFIG_ESP_PANEL_BOARD_TOUCH_BUS_SKIP_INIT_HOST=y